In [1]:
import pandas as pd

In [8]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

## **The ```pd.concat()``` Method, Part 1**

In [10]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [11]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [12]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

#### É muito conveniente juntarmos dois datasets diferentes em apenas um dataset utilizando o método pd.concat, ainda mais se os dois dataset's possuierem os mesmos nomes de colunas (equivalente ao comando 'union' do SQL).

In [19]:
pd.concat(objs = [week1, week2]).loc[0] # a ordem importa | os indices ficam duplicados
pd.concat(objs = [week1, week2], ignore_index = True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [22]:
week1.append(other = week2, ignore_index = True) # o 'append' é um método obsoleto, devemos utilizar o método 'concat' no lugar

/tmp/ipykernel_17581/3915486635.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  week1.append(other = week2, ignore_index = True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

## **The ```pd.concat()``` Method, Part 2**

In [25]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [30]:
# E se quisermos o melhor dos dois mundos aqui? E se quisermos ter identificadores exclusivos para cada linha e ainda manter os indices de cada dataframe?

sales = pd.concat(objs = [week1, week2], keys = ["Week 1", "Week 2"]) # agora criamos um multi-indice para o nosso Dataframe
sales.head(3)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [36]:
sales.loc[("Week 1",)] # assim mantemos o contexto de negócio de vendas observadas a nível de semana

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [40]:
sales.loc[("Week 2", 130), "Customer ID"]

240

In [41]:
sales.loc[("Week 2", 130), ["Customer ID", "Food ID"]]

Customer ID    240
Food ID          2
Name: (Week 2, 130), dtype: int64

## **Inner Joins, Part 1**

In [42]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [43]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [44]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [54]:
# Abaixo estamos encontrando um intervalo comum entre os dois conjuntos de dados onde o "Customer ID" está presente nos dois conjuntos (intersecção).

week1.merge(right = week2, how = "inner", on = "Customer ID", suffixes = ["_week1", "_week2"]).head(4)

   Customer ID  Food ID_week1  Food ID_week2
0          537              9              5
1          155              9              3
2          155              1              3
3          503              5              8

In [50]:
week1.query("`Customer ID` == 155")

    Customer ID  Food ID
4           155        9
17          155        1

In [51]:
week2.query("`Customer ID` == 155")

     Customer ID  Food ID
208          155        3

#### Resumo:
* Podemos juntar conjuntos de dados que possuem valores em comum com o método "merge";
* Nesse caso, podemos utilizar o método merge para diger que onde os valores forem iguais nos dois datasets, queremos trazer as demais colunas de ambos;
* Podemos realizar essa junção utilizando algumas estratégias como "inner", "left", "right" e cross. Por exemplo, se quisermos que o nosso novo dataframe apenas traga colunas para onde os valores nos dois datasets são iguais, utilizamos o argumento "inner". Se quisermos todos os dados do dataframe da esquerda, mesmo que não tenho correspondência nos dados do dataframe da direita, usamos o argumento "left", e case quisermos o contrário, usamos o argumento "right".

## **Inner Joins, Part 2**

In [55]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [56]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [57]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [58]:
week1.merge(right = week2, how = "inner", on = ["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [61]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

In [62]:
week2[week2["Customer ID"] == 21]

    Customer ID  Food ID
30           21        4

In [68]:
tmp_df = pd.DataFrame(columns = ["Customer ID", "Food ID"])

In [69]:
tmp_df["Customer ID"] = [578, 578]

In [72]:
tmp_df["Food ID"] = [5, 5]

In [76]:
tmp_df.drop(labels = 1, inplace = True)

In [79]:
pd.concat(objs = [week1, tmp_df], keys = ["Week 1", "Teste"]).merge(right = week2, how = "inner", on = ["Customer ID", "Food ID"])

    Customer ID  Food ID
0           304        3
1           540        3
2           937       10
3           233        3
4            21        4
5            21        4
6           922        1
7           578        5
8           578        5
9           578        5
10          578        5

In [81]:
pd.concat(objs = [week1, tmp_df], keys = ["Week 1", "Teste"]).query("`Customer ID` == 578")

            Customer ID  Food ID
Week 1 224          578        5
Teste  0            578        5

In [82]:
week2[week2["Customer ID"] == 578]

     Customer ID  Food ID
29           578        5
189          578        5

#### Meio difícil de explicar porque temos 4 registros pro ID acima, mas vamos tentar:
* Primeiro olhamos para o dataset 1 e procuramos correspondêcia de registros no dataset 2. Então para o primeiro registro, temos duas correspondências no dataset 2, logo, trazemos 2 registros para o nosso novo Dataframe;
* Depois olhamos para o próximo registro no dataset 1, e novamente encontramos mais duas correspondências no dataset 2, e trazemos mais 2 registros para o nosso novo Dataframe;

## **Outer Joins**

In [83]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [84]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [85]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [90]:
# Se não tivermos valores nulos em ambas as colunas, significa que o id do cliente foi encontrado em ambos os datasets
# Se alguma coluna estiver nula, é porque o id do cliente não consta em algum dos datasets
# Onde tivermos valores válidos para o Customer ID, teremos os dois valores dos dois datasets em uma única linha, e para as demais ocorrências, teremos uma linha para cada ID.

# O parâmetro "indicator", indica de quais datasets temos os valores fundidos

merged = week1.merge(right = week2, how = "outer", on = "Customer ID", suffixes = ["_week1", "_week2"], indicator = True)

In [92]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [94]:
left_right = merged["_merge"].isin(values = ["left_only", "right_only"]) # É assim que descobrimos quais valores que estão nos dados, mas não em ambos os datasets

In [97]:
merged[left_right]

     Customer ID  Food ID_week1  Food ID_week2      _merge
1             97            4.0            NaN   left_only
2            658            1.0            NaN   left_only
3            202            2.0            NaN   left_only
6            213            8.0            NaN   left_only
7            600            1.0            NaN   left_only
..           ...            ...            ...         ...
449          855            NaN            4.0  right_only
450          559            NaN           10.0  right_only
451          276            NaN            4.0  right_only
452          556            NaN           10.0  right_only
453          252            NaN            9.0  right_only

[392 rows x 4 columns]

In [98]:
merged[~left_right]

     Customer ID  Food ID_week1  Food ID_week2 _merge
0            537            9.0            5.0   both
4            155            9.0            3.0   both
5            155            1.0            3.0   both
8            503            5.0            8.0   both
9            503            5.0            9.0   both
..           ...            ...            ...    ...
246          945            5.0            4.0   both
247          343            3.0            5.0   both
248          343            3.0            2.0   both
249          343            3.0            7.0   both
251          621            9.0            6.0   both

[62 rows x 4 columns]

## **Left Joins**

In [99]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [104]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [103]:
foods.head(3)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99
2        3      Taco   2.99

In [111]:
week1 = week1.merge(right = foods, how = "left", on = "Food ID", sort = True) # O parâmetro "sort" vai ordenar os valores da nossa "match column"

In [112]:
week1.head()

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99
3          341        1     Sushi   3.99
4           20        1     Sushi   3.99

## **The left_on and right_on Parameters**

In [113]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [116]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [119]:
customers.head(8)

,ID,First Name,Last Name,Gender,Company,Occupation
0,1,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,2,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,3,Roger,Black,Male,Tagfeed,Account Executive
3,4,Steven,Evans,Male,Fatz,Registered Nurse
4,5,Judy,Morrison,Female,Demivee,Legal Assistant
5,6,Amanda,Howell,Female,Thoughtbridge,Dental Hygienist
6,7,Johnny,Reid,Male,Babblestorm,Account Executive
7,8,Frances,Adams,Female,Dabshots,Developer III

In [123]:
week2 = week2.merge(right = customers, how = "left", left_on = "Customer ID", right_on = "ID", sort = True).drop(columns = "ID")

In [124]:
week2.head()

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive
3,24,8,Donna,Thomas,Female,Jaxbean,Chief Design Engineer
4,27,4,Jessica,Bennett,Female,Twitternation,Account Executive